<center><h1> Pandas Series </h1></center>

In [1]:
import pandas as pd

In [2]:
series = pd.Series([1,2,3,6,6,2,2,5,3,8,8])

In [3]:
series

0     1
1     2
2     3
3     6
4     6
5     2
6     2
7     5
8     3
9     8
10    8
dtype: int64

In [4]:
# series.index=['a','b','c','d','e']

In [5]:
series.value_counts()

2    3
8    2
6    2
3    2
5    1
1    1
dtype: int64

In [6]:
series.values

array([1, 2, 3, 6, 6, 2, 2, 5, 3, 8, 8], dtype=int64)

In [7]:
series.index

RangeIndex(start=0, stop=11, step=1)

# Example

In [8]:
sales = pd.Series([100,50,99,80,64,75,23], index=['Mon', 'Tue', 'Wed', 'Thur', 'Fri', 'Sat', 'Sun'], name="Sandwich Sale")

In [9]:
sales

Mon     100
Tue      50
Wed      99
Thur     80
Fri      64
Sat      75
Sun      23
Name: Sandwich Sale, dtype: int64

In [10]:
sales.index

Index(['Mon', 'Tue', 'Wed', 'Thur', 'Fri', 'Sat', 'Sun'], dtype='object')

# Acces Data from Pandas Series

In [11]:
sales[1]

50

In [12]:
sales['Wed']

99

# Select Multiple Values

In [13]:
sales[[1,5]]

Tue    50
Sat    75
Name: Sandwich Sale, dtype: int64

In [14]:
sales[["Mon",'Tue','Sat']]

Mon    100
Tue     50
Sat     75
Name: Sandwich Sale, dtype: int64

In [15]:
sales['Mon':'Fri']

Mon     100
Tue      50
Wed      99
Thur     80
Fri      64
Name: Sandwich Sale, dtype: int64

# Conditional Selection

In [16]:
sales[sales > 70]

Mon     100
Wed      99
Thur     80
Sat      75
Name: Sandwich Sale, dtype: int64

In [17]:
sales[sales < 60]

Tue    50
Sun    23
Name: Sandwich Sale, dtype: int64

# Want to multiply a full series with any number.

In [18]:
sales * 2

Mon     200
Tue     100
Wed     198
Thur    160
Fri     128
Sat     150
Sun      46
Name: Sandwich Sale, dtype: int64

In [19]:
sales =  sales * 2

In [20]:
sales

Mon     200
Tue     100
Wed     198
Thur    160
Fri     128
Sat     150
Sun      46
Name: Sandwich Sale, dtype: int64

In [21]:
sales = sales / 2

In [22]:
sales = sales // 2

In [23]:
sales

Mon     50.0
Tue     25.0
Wed     49.0
Thur    40.0
Fri     32.0
Sat     37.0
Sun     11.0
Name: Sandwich Sale, dtype: float64

In [24]:
'Mon' in sales

True

In [25]:
'Friday' in sales

False

In [26]:
sales.index

Index(['Mon', 'Tue', 'Wed', 'Thur', 'Fri', 'Sat', 'Sun'], dtype='object')

# We can get data from a numpy array to make a series.

In [27]:
import numpy as np

In [28]:
ar1 = np.array([5,6,9,3,7,8,6,2])

In [29]:
ar2 =  np.array(['a','b','c','d','e','f','g','h'])

In [30]:
numpyseries = pd.Series(ar1, index=ar2)

In [31]:
numpyseries

a    5
b    6
c    9
d    3
e    7
f    8
g    6
h    2
dtype: int32

In [32]:
ar3 = np.array(numpyseries)

In [33]:
ar3

array([5, 6, 9, 3, 7, 8, 6, 2])

# Make series from a dictionary

In [34]:
dict = {"Sales":ar1, "Sandwitch":sales}

In [35]:
series1 = pd.Series(dict)

In [36]:
series1

Sales                                 [5, 6, 9, 3, 7, 8, 6, 2]
Sandwitch    Mon     50.0
Tue     25.0
Wed     49.0
Thur   ...
dtype: object

In [37]:
series1.ndim

1

In [38]:
dict1 = {"A":10,"B":20,"F":30,"D":40,"I":60}

In [39]:
series3 = pd.Series(dict1, index = ['A','B','C','D','E','F','G','H','I'])

In [40]:
series3

A    10.0
B    20.0
C     NaN
D    40.0
E     NaN
F    30.0
G     NaN
H     NaN
I    60.0
dtype: float64

# Check the Null Values in Series

In [41]:
series3.isnull()

A    False
B    False
C     True
D    False
E     True
F    False
G     True
H     True
I    False
dtype: bool

In [42]:
series3.notnull()

A     True
B     True
C    False
D     True
E    False
F     True
G    False
H    False
I     True
dtype: bool

In [43]:
series3.itemsize

C:\Users\syedh\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Series.itemsize is deprecated and will be removed in a future version
  """Entry point for launching an IPython kernel.

8

# Now we are going to start Pandas DataFrame

In [44]:
import pandas as pd

In [45]:
data= {"One":series,  "Three":series3}

In [46]:
df = pd.DataFrame(data)

In [47]:
df

    One  Three
0   1.0    NaN
1   2.0    NaN
2   3.0    NaN
3   6.0    NaN
4   6.0    NaN
5   2.0    NaN
6   2.0    NaN
7   5.0    NaN
8   3.0    NaN
9   8.0    NaN
10  8.0    NaN
A   NaN   10.0
B   NaN   20.0
C   NaN    NaN
D   NaN   40.0
E   NaN    NaN
F   NaN   30.0
G   NaN    NaN
H   NaN    NaN
I   NaN   60.0

In [48]:
country = np.array(['London', 'Birmingham', 'Tokyo','Russia','China', 'Pakistan'])

In [49]:
year = np.array([2000,2001,2002,2003,2004,2005])

In [50]:
population = np.array([6000,5000,2300,4100,2100,3100])

In [51]:
data = {'Country':country, 'Year':year,'Population':population}

In [52]:
population_data = pd.DataFrame(data)

In [53]:
population_data

      Country  Year  Population
0      London  2000        6000
1  Birmingham  2001        5000
2       Tokyo  2002        2300
3      Russia  2003        4100
4       China  2004        2100
5    Pakistan  2005        3100

In [54]:
population_data = pd.DataFrame(data, columns=['Year','Country','Population'])

In [55]:
population_data

   Year     Country  Population
0  2000      London        6000
1  2001  Birmingham        5000
2  2002       Tokyo        2300
3  2003      Russia        4100
4  2004       China        2100
5  2005    Pakistan        3100

In [56]:
population_data.head(3)

   Year     Country  Population
0  2000      London        6000
1  2001  Birmingham        5000
2  2002       Tokyo        2300

In [57]:
population_data = pd.DataFrame(data,columns=['Year', 'Country', 'Population','Debt'])

In [58]:
population_data

   Year     Country  Population Debt
0  2000      London        6000  NaN
1  2001  Birmingham        5000  NaN
2  2002       Tokyo        2300  NaN
3  2003      Russia        4100  NaN
4  2004       China        2100  NaN
5  2005    Pakistan        3100  NaN

In [59]:
population_data = pd.DataFrame(data,columns=['Year', 'Country', 'Population','Debt'], index=['one', 'Two', 'Three', 'Four', 'Five', 'Six'])

In [60]:
population_data

       Year     Country  Population Debt
one    2000      London        6000  NaN
Two    2001  Birmingham        5000  NaN
Three  2002       Tokyo        2300  NaN
Four   2003      Russia        4100  NaN
Five   2004       China        2100  NaN
Six    2005    Pakistan        3100  NaN

In [61]:
population_data.columns

Index(['Year', 'Country', 'Population', 'Debt'], dtype='object')

In [62]:
population_data.index

Index(['one', 'Two', 'Three', 'Four', 'Five', 'Six'], dtype='object')

# Acces Data from a DataFrame

In [63]:
population_data['Year']

one      2000
Two      2001
Three    2002
Four     2003
Five     2004
Six      2005
Name: Year, dtype: int32

In [64]:
population_data['Country']

one          London
Two      Birmingham
Three         Tokyo
Four         Russia
Five          China
Six        Pakistan
Name: Country, dtype: object

In [65]:
population_data.Country

one          London
Two      Birmingham
Three         Tokyo
Four         Russia
Five          China
Six        Pakistan
Name: Country, dtype: object

# Accessing data on the basis of condition

In [66]:
population_data[population_data.Population > 3000]

      Year     Country  Population Debt
one   2000      London        6000  NaN
Two   2001  Birmingham        5000  NaN
Four  2003      Russia        4100  NaN
Six   2005    Pakistan        3100  NaN

In [67]:
population_data[population_data.Population < 3000]

       Year Country  Population Debt
Three  2002   Tokyo        2300  NaN
Five   2004   China        2100  NaN

# Till now we have acces to the columns full but not the selected row, now we are going to select the rows from a dataframe.

In [68]:
population_data

       Year     Country  Population Debt
one    2000      London        6000  NaN
Two    2001  Birmingham        5000  NaN
Three  2002       Tokyo        2300  NaN
Four   2003      Russia        4100  NaN
Five   2004       China        2100  NaN
Six    2005    Pakistan        3100  NaN

In [69]:
population_data.loc['Two']

Year                2001
Country       Birmingham
Population          5000
Debt                 NaN
Name: Two, dtype: object

In [70]:
population_data.loc['one':'Five']

       Year     Country  Population Debt
one    2000      London        6000  NaN
Two    2001  Birmingham        5000  NaN
Three  2002       Tokyo        2300  NaN
Four   2003      Russia        4100  NaN
Five   2004       China        2100  NaN

In [71]:
ln = len(population_data)

In [72]:
ln

6

# Now we are going to fill the Debt column

#### One thing must be remember that you number of rows not more than the values you are going to enter

In [73]:
population_data['Debt'] = [5,9,6,7,5,3]

In [74]:
population_data

       Year     Country  Population  Debt
one    2000      London        6000     5
Two    2001  Birmingham        5000     9
Three  2002       Tokyo        2300     6
Four   2003      Russia        4100     7
Five   2004       China        2100     5
Six    2005    Pakistan        3100     3

### One way to fill put the values is that you put the values by entering manually, and another way to create a numpy array to fill it out

In [75]:
import numpy as np

In [76]:
arng = np.arange(ln)

In [77]:
arng

array([0, 1, 2, 3, 4, 5])

In [78]:
population_data['Debt'] = arng

In [79]:
population_data

       Year     Country  Population  Debt
one    2000      London        6000     0
Two    2001  Birmingham        5000     1
Three  2002       Tokyo        2300     2
Four   2003      Russia        4100     3
Five   2004       China        2100     4
Six    2005    Pakistan        3100     5

In [80]:
population_data['Debt'] = population_data['Population'] // 2

In [81]:
population_data

       Year     Country  Population  Debt
one    2000      London        6000  3000
Two    2001  Birmingham        5000  2500
Three  2002       Tokyo        2300  1150
Four   2003      Russia        4100  2050
Five   2004       China        2100  1050
Six    2005    Pakistan        3100  1550

In [82]:
val = pd.Series([2100,3600,4400,1984,2536,2132])

In [83]:
population_data['Debt'] = val

In [84]:
population_data

       Year     Country  Population  Debt
one    2000      London        6000   NaN
Two    2001  Birmingham        5000   NaN
Three  2002       Tokyo        2300   NaN
Four   2003      Russia        4100   NaN
Five   2004       China        2100   NaN
Six    2005    Pakistan        3100   NaN

## You can see that the values are NaN because the default index are start from 0 and ends on length. But here the indexs are different, so that is the reason the values are NaN. So now we are going to give the indexes to put these values.

In [85]:
val = pd.Series([2100,3600,4400,1984,2536,2132], index=['one','Two','Three','Four', 'Five','Six'])

In [86]:
population_data['Debt'] = val

In [87]:
population_data

       Year     Country  Population  Debt
one    2000      London        6000  2100
Two    2001  Birmingham        5000  3600
Three  2002       Tokyo        2300  4400
Four   2003      Russia        4100  1984
Five   2004       China        2100  2536
Six    2005    Pakistan        3100  2132

In [88]:
population_data['Debt'].min()

1984

In [89]:
population_data['Debt'].max()

4400

In [90]:
val1 = population_data['Debt'].max() - population_data['Debt'].min()

In [91]:
val1

2416

In [92]:
f= lambda x: x.max() - x.min()

In [93]:
def min_max(x):
    minimum = x.min()
    maximum = x.max()
    return pd.Series([minimum, maximum], index=['min', 'max'])

In [94]:
frame = pd.DataFrame(np.random.randn(4,3), columns=list('bde'), index=['A', 'B', 'C', 'D'])

In [95]:
frame

          b         d         e
A -0.192208 -0.226041 -0.456421
B  0.054551 -0.256694 -0.110442
C -0.180144 -0.369404 -0.215025
D  0.706472 -2.228025  1.527955

In [96]:
np.abs(frame)

          b         d         e
A  0.192208  0.226041  0.456421
B  0.054551  0.256694  0.110442
C  0.180144  0.369404  0.215025
D  0.706472  2.228025  1.527955

In [97]:
df = frame.apply(f)

In [98]:
df

b    0.898680
d    2.001984
e    1.984376
dtype: float64

In [99]:
df = frame.apply(min_max)

In [100]:
df

            b         d         e
min -0.192208 -2.228025 -0.456421
max  0.706472 -0.226041  1.527955

In [101]:
df = frame.apply(f, axis=1)

In [102]:
df

A    0.264213
B    0.311246
C    0.189260
D    3.755980
dtype: float64

In [103]:
df = frame.apply(min_max, axis=1)

In [104]:
df

        min       max
A -0.456421 -0.192208
B -0.256694  0.054551
C -0.369404 -0.180144
D -2.228025  1.527955

In [105]:
frame

          b         d         e
A -0.192208 -0.226041 -0.456421
B  0.054551 -0.256694 -0.110442
C -0.180144 -0.369404 -0.215025
D  0.706472 -2.228025  1.527955

In [106]:
frame.sort_index()

          b         d         e
A -0.192208 -0.226041 -0.456421
B  0.054551 -0.256694 -0.110442
C -0.180144 -0.369404 -0.215025
D  0.706472 -2.228025  1.527955

In [107]:
frame1 = pd.DataFrame(np.random.randn(4,4), columns=['B','A','Z','T'], index=['D', 'C', 'B','E'])

In [108]:
frame1

          B         A         Z         T
D  1.210389 -0.511951 -0.065854  1.202718
C -0.619302 -0.199265 -0.525166  1.302257
B -1.699034 -0.569160 -0.406806 -0.016713
E -0.037048 -0.033029  0.490912 -0.636250

In [109]:
frame1.sort_index(axis=1)

          A         B         T         Z
D -0.511951  1.210389  1.202718 -0.065854
C -0.199265 -0.619302  1.302257 -0.525166
B -0.569160 -1.699034 -0.016713 -0.406806
E -0.033029 -0.037048 -0.636250  0.490912

In [110]:
frame1.sort_index(axis=0)

          B         A         Z         T
B -1.699034 -0.569160 -0.406806 -0.016713
C -0.619302 -0.199265 -0.525166  1.302257
D  1.210389 -0.511951 -0.065854  1.202718
E -0.037048 -0.033029  0.490912 -0.636250

In [111]:
frame1 = frame1.sort_index(axis=0)

In [112]:
frame1 = frame1.sort_index(axis=1)

In [113]:
frame1

          A         B         T         Z
B -0.569160 -1.699034 -0.016713 -0.406806
C -0.199265 -0.619302  1.302257 -0.525166
D -0.511951  1.210389  1.202718 -0.065854
E -0.033029 -0.037048 -0.636250  0.490912

In [114]:
frame2 = pd.DataFrame(np.random.randn(4,4), columns=['B','A','Z','T'])

In [115]:
frame2

          B         A         Z         T
0 -0.938043  2.361166 -0.335454  1.043408
1  1.716122  0.353708  1.788233 -1.073351
2  0.549973 -1.272577 -0.598969  1.696397
3 -0.419285 -0.642521  1.363471  0.775430

In [116]:
frame2.sort_index(axis=0)

          B         A         Z         T
0 -0.938043  2.361166 -0.335454  1.043408
1  1.716122  0.353708  1.788233 -1.073351
2  0.549973 -1.272577 -0.598969  1.696397
3 -0.419285 -0.642521  1.363471  0.775430

In [117]:
# frame2.sort_values('A',axis=1)

In [118]:
frame1

          A         B         T         Z
B -0.569160 -1.699034 -0.016713 -0.406806
C -0.199265 -0.619302  1.302257 -0.525166
D -0.511951  1.210389  1.202718 -0.065854
E -0.033029 -0.037048 -0.636250  0.490912

In [119]:
a = np.arange(4)

In [120]:
frame1['A'] = a

In [121]:
b = np.arange(6,10)

In [122]:
c = np.arange(20,24)

In [123]:
d = np.arange(15,19)

In [124]:
e = np.arange(31,35)

In [125]:
f = np.arange(27,31)

In [126]:
f

array([27, 28, 29, 30])

In [127]:
frame1['B'] = b

In [128]:
frame1['C'] = c

In [129]:
frame1['D'] = d

In [130]:
frame1['T'] = e

In [131]:
frame1['Z'] = f

In [132]:
frame1

   A  B   T   Z   C   D
B  0  6  31  27  20  15
C  1  7  32  28  21  16
D  2  8  33  29  22  17
E  3  9  34  30  23  18

In [133]:
frame1= frame1.sort_index(axis=1)

In [134]:
frame1

   A  B   C   D   T   Z
B  0  6  20  15  31  27
C  1  7  21  16  32  28
D  2  8  22  17  33  29
E  3  9  23  18  34  30

In [135]:
frame1.sort_values(by=['A'],axis=0, ascending=True)

   A  B   C   D   T   Z
B  0  6  20  15  31  27
C  1  7  21  16  32  28
D  2  8  22  17  33  29
E  3  9  23  18  34  30

In [136]:
frame2

          B         A         Z         T
0 -0.938043  2.361166 -0.335454  1.043408
1  1.716122  0.353708  1.788233 -1.073351
2  0.549973 -1.272577 -0.598969  1.696397
3 -0.419285 -0.642521  1.363471  0.775430

In [137]:
frame3 = pd.DataFrame(np.random.randn(4,4), columns=['B','A','Z','T'])

In [138]:
frame3

          B         A         Z         T
0 -3.481241 -0.179677  1.520795  0.432786
1  1.227032  0.179299  0.467603 -0.330998
2 -0.697838 -0.345174 -0.704305  1.320141
3 -1.290171  1.898772  0.103993 -1.372579

In [139]:
frame3['B'] = a

In [140]:
frame3['A'] = e

In [141]:
frame3['Z'] = f

In [142]:
frame3['T'] = b

In [143]:
frame3

   B   A   Z  T
0  0  31  27  6
1  1  32  28  7
2  2  33  29  8
3  3  34  30  9

In [144]:
frame3.sort_values(by=['B'])

   B   A   Z  T
0  0  31  27  6
1  1  32  28  7
2  2  33  29  8
3  3  34  30  9

In [145]:
frame3.rank(ascending=True, method='max',  axis='columns')

     B    A    Z    T
0  1.0  4.0  3.0  2.0
1  1.0  4.0  3.0  2.0
2  1.0  4.0  3.0  2.0
3  1.0  4.0  3.0  2.0

In [146]:
frame3.sum(axis='columns')

0    64
1    68
2    72
3    76
dtype: int64

In [147]:
frame3.sum(axis=0)

B      6
A    130
Z    114
T     30
dtype: int64

In [148]:
frame3

   B   A   Z  T
0  0  31  27  6
1  1  32  28  7
2  2  33  29  8
3  3  34  30  9

In [149]:
frame3['B'].unique

<bound method Series.unique of 0    0
1    1
2    2
3    3
Name: B, dtype: int32>

In [150]:
frame3['Z'].unique

<bound method Series.unique of 0    27
1    28
2    29
3    30
Name: Z, dtype: int32>

In [151]:
frame3['Z'].value_counts()

30    1
29    1
28    1
27    1
Name: Z, dtype: int64

In [152]:
frame3

   B   A   Z  T
0  0  31  27  6
1  1  32  28  7
2  2  33  29  8
3  3  34  30  9

In [153]:
population_data.loc['one',['Year']]

Year    2000
Name: one, dtype: object

In [154]:
population_data

       Year     Country  Population  Debt
one    2000      London        6000  2100
Two    2001  Birmingham        5000  3600
Three  2002       Tokyo        2300  4400
Four   2003      Russia        4100  1984
Five   2004       China        2100  2536
Six    2005    Pakistan        3100  2132

In [155]:
population_data.loc['one':'Five',['Year','Population']]

       Year  Population
one    2000        6000
Two    2001        5000
Three  2002        2300
Four   2003        4100
Five   2004        2100

In [156]:
population_data.iloc[0:3,[0,2]]

       Year  Population
one    2000        6000
Two    2001        5000
Three  2002        2300

In [157]:
frame4 = frame1 + frame2

In [158]:
frame4

    A   B   C   D   T   Z
B NaN NaN NaN NaN NaN NaN
C NaN NaN NaN NaN NaN NaN
D NaN NaN NaN NaN NaN NaN
E NaN NaN NaN NaN NaN NaN
0 NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN

# This is because the indexes are not same, if the indexes are same then it will add properly.

In [159]:
frame

          b         d         e
A -0.192208 -0.226041 -0.456421
B  0.054551 -0.256694 -0.110442
C -0.180144 -0.369404 -0.215025
D  0.706472 -2.228025  1.527955

In [160]:
frame1

   A  B   C   D   T   Z
B  0  6  20  15  31  27
C  1  7  21  16  32  28
D  2  8  22  17  33  29
E  3  9  23  18  34  30

In [161]:
frame2

          B         A         Z         T
0 -0.938043  2.361166 -0.335454  1.043408
1  1.716122  0.353708  1.788233 -1.073351
2  0.549973 -1.272577 -0.598969  1.696397
3 -0.419285 -0.642521  1.363471  0.775430

In [162]:
frame3

   B   A   Z  T
0  0  31  27  6
1  1  32  28  7
2  2  33  29  8
3  3  34  30  9

In [163]:
frame5 = frame + frame1

In [164]:
frame5

    A   B   C   D   T   Z   b   d   e
A NaN NaN NaN NaN NaN NaN NaN NaN NaN
B NaN NaN NaN NaN NaN NaN NaN NaN NaN
C NaN NaN NaN NaN NaN NaN NaN NaN NaN
D NaN NaN NaN NaN NaN NaN NaN NaN NaN
E NaN NaN NaN NaN NaN NaN NaN NaN NaN

# In this case coloumns are also not matching.

In [165]:
fr1 = pd.DataFrame(np.random.rand(16).reshape(4*4))

In [166]:
fr2 = pd.DataFrame(np.arange(20,30).reshape(5*2))

In [167]:
fr1.dtypes

0    float64
dtype: object

In [168]:
fr3 = fr1 + fr2

In [169]:
fr3

            0
0   20.325687
1   21.991364
2   22.402211
3   23.583664
4   24.241624
5   25.527159
6   26.650422
7   27.174243
8   28.516699
9   29.557250
10        NaN
11        NaN
12        NaN
13        NaN
14        NaN
15        NaN

# Now the addition will be done.

In [170]:
df1 = pd.DataFrame(np.arange(16).reshape(4,4), columns=['A','B','C','D'])

In [171]:
df2 = pd.DataFrame(np.arange(16,32).reshape(4,4), columns=['A','B','C','D'])

In [172]:
df3 = df1.add(df2, fill_value=0)

In [173]:
df3

    A   B   C   D
0  16  18  20  22
1  24  26  28  30
2  32  34  36  38
3  40  42  44  46

In [174]:
df4 = df1 - df2

In [175]:
df4

    A   B   C   D
0 -16 -16 -16 -16
1 -16 -16 -16 -16
2 -16 -16 -16 -16
3 -16 -16 -16 -16

In [176]:
ser = pd.Series(np.arange(4), index=list('ABCD'))

In [177]:
df3

    A   B   C   D
0  16  18  20  22
1  24  26  28  30
2  32  34  36  38
3  40  42  44  46

In [178]:
df3 - ser

    A   B   C   D
0  16  17  18  19
1  24  25  26  27
2  32  33  34  35
3  40  41  42  43

In [179]:
df3

    A   B   C   D
0  16  18  20  22
1  24  26  28  30
2  32  34  36  38
3  40  42  44  46

# Reindexing

In [180]:
df3

    A   B   C   D
0  16  18  20  22
1  24  26  28  30
2  32  34  36  38
3  40  42  44  46

In [181]:
col = ['A','B','C','D','AB','CD','EF','GH']

In [182]:
df3.reindex([0,1,2,3,4])

      A     B     C     D
0  16.0  18.0  20.0  22.0
1  24.0  26.0  28.0  30.0
2  32.0  34.0  36.0  38.0
3  40.0  42.0  44.0  46.0
4   NaN   NaN   NaN   NaN

In [183]:
df3.reindex([0,1,2,3,4,], method='ffill')

    A   B   C   D
0  16  18  20  22
1  24  26  28  30
2  32  34  36  38
3  40  42  44  46
4  40  42  44  46

In [184]:
df.reindex(columns=col, index=list('ABCD'))

    A   B   C   D  AB  CD  EF  GH
A NaN NaN NaN NaN NaN NaN NaN NaN
B NaN NaN NaN NaN NaN NaN NaN NaN
C NaN NaN NaN NaN NaN NaN NaN NaN
D NaN NaN NaN NaN NaN NaN NaN NaN

In [185]:
df3.reindex(columns=col)

    A   B   C   D  AB  CD  EF  GH
0  16  18  20  22 NaN NaN NaN NaN
1  24  26  28  30 NaN NaN NaN NaN
2  32  34  36  38 NaN NaN NaN NaN
3  40  42  44  46 NaN NaN NaN NaN

In [186]:
df3.reindex(columns=col, method='ffill')

    A   B   C   D  AB  CD  EF  GH
0  16  18  20  22  16  20  22  22
1  24  26  28  30  24  28  30  30
2  32  34  36  38  32  36  38  38
3  40  42  44  46  40  44  46  46

In [187]:
df3.drop_duplicates()

    A   B   C   D
0  16  18  20  22
1  24  26  28  30
2  32  34  36  38
3  40  42  44  46

In [188]:
df3.drop('A', axis=1)

    B   C   D
0  18  20  22
1  26  28  30
2  34  36  38
3  42  44  46

In [189]:
df3

    A   B   C   D
0  16  18  20  22
1  24  26  28  30
2  32  34  36  38
3  40  42  44  46

In [190]:
df3 = df3.reindex([0,1,2,3,4,5], method='ffill')

In [191]:
df3

    A   B   C   D
0  16  18  20  22
1  24  26  28  30
2  32  34  36  38
3  40  42  44  46
4  40  42  44  46
5  40  42  44  46

In [192]:
df3 = df3.reindex([0,1,2,3,4,5,6])

In [193]:
df3

      A     B     C     D
0  16.0  18.0  20.0  22.0
1  24.0  26.0  28.0  30.0
2  32.0  34.0  36.0  38.0
3  40.0  42.0  44.0  46.0
4  40.0  42.0  44.0  46.0
5  40.0  42.0  44.0  46.0
6   NaN   NaN   NaN   NaN

In [194]:
df3.dropna()

      A     B     C     D
0  16.0  18.0  20.0  22.0
1  24.0  26.0  28.0  30.0
2  32.0  34.0  36.0  38.0
3  40.0  42.0  44.0  46.0
4  40.0  42.0  44.0  46.0
5  40.0  42.0  44.0  46.0

In [195]:
df3.drop_duplicates()

      A     B     C     D
0  16.0  18.0  20.0  22.0
1  24.0  26.0  28.0  30.0
2  32.0  34.0  36.0  38.0
3  40.0  42.0  44.0  46.0
6   NaN   NaN   NaN   NaN

In [196]:
df3.drop('B', axis=1)

      A     C     D
0  16.0  20.0  22.0
1  24.0  28.0  30.0
2  32.0  36.0  38.0
3  40.0  44.0  46.0
4  40.0  44.0  46.0
5  40.0  44.0  46.0
6   NaN   NaN   NaN

In [197]:
df3.drop(3, axis=0)

      A     B     C     D
0  16.0  18.0  20.0  22.0
1  24.0  26.0  28.0  30.0
2  32.0  34.0  36.0  38.0
4  40.0  42.0  44.0  46.0
5  40.0  42.0  44.0  46.0
6   NaN   NaN   NaN   NaN

In [198]:
df3 = df3.drop(3, axis=0)

In [199]:
df3

      A     B     C     D
0  16.0  18.0  20.0  22.0
1  24.0  26.0  28.0  30.0
2  32.0  34.0  36.0  38.0
4  40.0  42.0  44.0  46.0
5  40.0  42.0  44.0  46.0
6   NaN   NaN   NaN   NaN

In [200]:
df3 = df3.drop('B', axis=1)

In [201]:
df3

      A     C     D
0  16.0  20.0  22.0
1  24.0  28.0  30.0
2  32.0  36.0  38.0
4  40.0  44.0  46.0
5  40.0  44.0  46.0
6   NaN   NaN   NaN

In [202]:
col1=['A','B','C','D','E']

In [203]:
df3 = df3.reindex(columns=col1)

In [204]:
df3

      A   B     C     D   E
0  16.0 NaN  20.0  22.0 NaN
1  24.0 NaN  28.0  30.0 NaN
2  32.0 NaN  36.0  38.0 NaN
4  40.0 NaN  44.0  46.0 NaN
5  40.0 NaN  44.0  46.0 NaN
6   NaN NaN   NaN   NaN NaN

In [205]:
avg = 24.0

In [206]:
df3.drop_duplicates()

      A   B     C     D   E
0  16.0 NaN  20.0  22.0 NaN
1  24.0 NaN  28.0  30.0 NaN
2  32.0 NaN  36.0  38.0 NaN
4  40.0 NaN  44.0  46.0 NaN
6   NaN NaN   NaN   NaN NaN

In [207]:
avg = 24

In [208]:
df3 = df3.fillna(avg)

In [209]:
df3 = df3.drop_duplicates()

In [210]:
df3

      A     B     C     D     E
0  16.0  24.0  20.0  22.0  24.0
1  24.0  24.0  28.0  30.0  24.0
2  32.0  24.0  36.0  38.0  24.0
4  40.0  24.0  44.0  46.0  24.0
6  24.0  24.0  24.0  24.0  24.0

In [211]:
df3.loc[ :,['A','C']]

      A     C
0  16.0  20.0
1  24.0  28.0
2  32.0  36.0
4  40.0  44.0
6  24.0  24.0

In [212]:
df3.iloc[0:3,0:2]

      A     B
0  16.0  24.0
1  24.0  24.0
2  32.0  24.0

In [213]:
df3.loc[:,'A':'C']

      A     B     C
0  16.0  24.0  20.0
1  24.0  24.0  28.0
2  32.0  24.0  36.0
4  40.0  24.0  44.0
6  24.0  24.0  24.0

In [218]:
dataframe = pd.read_csv('ex1.csv')

In [219]:
dataframe

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [225]:
dataframe1 = pd.read_csv('ex1.csv', header=None, skiprows=1)

In [226]:
dataframe1

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [227]:
dataframe1 = pd.read_csv('ex1.csv', header=None, skiprows=1, names=['One', 'Two', 'Three', 'Message'])

In [228]:
dataframe1

   One  Two  Three Message
1    2    3      4   hello
5    6    7      8   world
9   10   11     12     foo

In [251]:
headers = ['ABC', 'DEF', 'GHI', 'JKL']

In [244]:
dataframe2 = pd.read_csv('ex1.csv', skiprows=1)

In [252]:
dataframe2.columns

Index(['1', '2', '3', '4', 'hello'], dtype='object')

In [253]:
dataframe

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [255]:
dataframe2

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [256]:
dataframe2

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [259]:
dataframe3 = pd.read_csv('ex3.csv')

In [260]:
dataframe3

  key1 key2  value1  value2
0  one    a       1       2
1  one    b       3       4
2  one    c       5       6
3  one    d       7       8
4  two    a       9      10
5  two    b      11      12
6  two    c      13      14
7  two    d      15      16

In [261]:
dataframe3.columns

Index(['key1', 'key2', 'value1', 'value2'], dtype='object')

In [262]:
dataframe3.columns = headers

In [263]:
dataframe3

   ABC DEF  GHI  JKL
0  one   a    1    2
1  one   b    3    4
2  one   c    5    6
3  one   d    7    8
4  two   a    9   10
5  two   b   11   12
6  two   c   13   14
7  two   d   15   16

In [274]:
dataframe3 = pd.read_csv('ex3.csv', skiprows=2, names=['AB','CD','EF','GH'])

In [275]:
dataframe3

    AB   CD    EF    GH
0  one    b   NaN   4.0
1  one    c   5.0   6.0
2  one  NaN   7.0   8.0
3  two    a   9.0   NaN
4  two    b   NaN  12.0
5  two  NaN  13.0   NaN
6  two    d  15.0  16.0

In [276]:
dataframe3.drop('GH', axis=1)

    AB   CD    EF
0  one    b   NaN
1  one    c   5.0
2  one  NaN   7.0
3  two    a   9.0
4  two    b   NaN
5  two  NaN  13.0
6  two    d  15.0

In [277]:
dataframe3

    AB   CD    EF    GH
0  one    b   NaN   4.0
1  one    c   5.0   6.0
2  one  NaN   7.0   8.0
3  two    a   9.0   NaN
4  two    b   NaN  12.0
5  two  NaN  13.0   NaN
6  two    d  15.0  16.0

In [280]:
dataframe3=dataframe3.dropna(subset=['GH'], axis=0)

In [281]:
dataframe3= dataframe3.dropna(subset=['EF'], axis=0)

In [282]:
dataframe3

    AB   CD    EF    GH
1  one    c   5.0   6.0
2  one  NaN   7.0   8.0
6  two    d  15.0  16.0

In [283]:
dataframe3.isnull()

      AB     CD     EF     GH
1  False  False  False  False
2  False   True  False  False
6  False  False  False  False

In [284]:
dataframe3 = pd.read_csv('ex3.csv', na_values='NaN')

In [285]:
dataframe3

  key1 key2  value1  value2
0  one    a     1.0     2.0
1  one    b     NaN     4.0
2  one    c     5.0     6.0
3  one  NaN     7.0     8.0
4  two    a     9.0     NaN
5  two    b     NaN    12.0
6  two  NaN    13.0     NaN
7  two    d    15.0    16.0

In [286]:
avg = 4.2

In [287]:
dataframe3.fillna(avg)

  key1 key2  value1  value2
0  one    a     1.0     2.0
1  one    b     4.2     4.0
2  one    c     5.0     6.0
3  one  4.2     7.0     8.0
4  two    a     9.0     4.2
5  two    b     4.2    12.0
6  two  4.2    13.0     4.2
7  two    d    15.0    16.0

# Hirerichal Index

### it means we use two columns as the column index

In [296]:
dataframe3 = pd.read_csv('ex1.csv', index_col=['a', 'b'])

In [297]:
dataframe3

       c   d message
a b
1 2    3   4   hello
5 6    7   8   world
9 10  11  12     foo

In [303]:
bigdata = pd.read_excel('Mobile2016.xlsx', header=None, skiprows=10)

In [304]:
bigdata

,0,1,2,3,4,5,6,7,8,9,...,62,63,64,65,66,67,68,69,70,71
0,1.0,82.0,81.0,91.0,65.0,130.0,88.0,61.0,113.0,72.0,...,0.258065,0.225806,0.387097,0.258065,0.258065,0.322581,0.193548,86.642857,0.154971,0.283410
1,1.0,100.0,72.0,79.0,53.0,110.0,119.0,88.0,58.0,64.0,...,0.290323,0.258065,0.322581,0.225806,0.258065,0.354839,0.322581,80.500000,0.188229,0.301843
2,1.0,133.0,118.0,145.0,118.0,88.0,102.0,89.0,105.0,103.0,...,0.290323,0.193548,0.419355,0.258065,0.258065,0.290323,0.451613,116.000000,0.323314,0.334101
3,1.0,136.0,104.0,147.0,92.0,79.0,129.0,88.0,69.0,120.0,...,0.322581,0.322581,0.419355,0.354839,0.225806,0.290323,0.516129,116.000000,0.354171,0.361751
4,1.0,150.0,139.0,135.0,106.0,79.0,100.0,97.0,95.0,97.0,...,0.322581,0.258065,0.419355,0.290323,0.258065,0.419355,0.612903,116.714286,0.319543,0.370968
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2901,56.0,79.0,73.0,89.0,72.0,52.0,78.0,67.0,77.0,71.0,...,0.129032,0.225806,0.193548,0.129032,0.129032,0.258065,0.225806,77.714286,0.092229,0.184332
2902,56.0,65.0,98.0,73.0,75.0,62.0,67.0,85.0,68.0,64.0,...,0.258065,0.225806,0.225806,0.161290,0.225806,0.161290,0.290323,75.142857,0.133714,0.235023
2903,56.0,88.0,85.0,71.0,63.0,104.0,81.0,85.0,80.0,82.0,...,0.225806,0.258065,0.290323,0.322581,0.322581,0.225806,0.258065,77.214286,0.153600,0.267281
2904,56.0,99.0,98.0,80.0,95.0,71.0,76.0,70.0,78.0,54.0,...,0.225806,0.225806,0.258065,0.225806,0.193548,0.225806,0.354839,74.714286,0.111429,0.258065
2905,56.0,80.0,73.0,97.0,94.0,61.0,65.0,96.0,70.0,54.0,...,0.225806,0.225806,0.290323,0.258065,0.193548,0.322581,0.322581,71.857143,0.114514,0.260369

In [306]:
bigdata.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2906 entries, 0 to 2905
Data columns (total 72 columns):
0     2851 non-null float64
1     2851 non-null float64
2     2851 non-null float64
3     2851 non-null float64
4     2851 non-null float64
5     2851 non-null float64
6     2851 non-null float64
7     2851 non-null float64
8     2851 non-null float64
9     2851 non-null float64
10    2851 non-null float64
11    2851 non-null float64
12    2851 non-null float64
13    2851 non-null float64
14    2851 non-null float64
15    2851 non-null float64
16    2851 non-null float64
17    2851 non-null float64
18    2851 non-null float64
19    2851 non-null float64
20    2851 non-null float64
21    2851 non-null float64
22    2851 non-null float64
23    2851 non-null float64
24    2851 non-null float64
25    2851 non-null float64
26    2851 non-null float64
27    2851 non-null float64
28    2851 non-null float64
29    2851 non-null float64
30    2851 non-null float64
31    2851 non-null float64
32    2851 non-null float64
33    2851 non-null float64
34    2851 non-null float64
35    2851 non-null float64
36    2851 non-null float64
37    2851 non-null float64
38    2851 non-null float64
39    2851 non-null float64
40    2851 non-null float64
41    2851 non-null float64
42    2851 non-null float64
43    2851 non-null float64
44    2851 non-null float64
45    2851 non-null float64
46    2851 non-null float64
47    2851 non-null float64
48    2851 non-null float64
49    2851 non-null float64
50    2851 non-null float64
51    2851 non-null float64
52    2851 non-null float64
53    2851 non-null float64
54    2851 non-null float64
55    2851 non-null float64
56    2851 non-null float64
57    2851 non-null float64
58    2851 non-null float64
59    2851 non-null float64
60    2851 non-null float64
61    2851 non-null float64
62    2851 non-null float64
63    2851 non-null float64
64    2851 non-null float64
65    2851 non-null float64
66    2851 non-null float64
67    2851 non-null float64
68    2851 non-null float64
69    2851 non-null float64
70    2851 non-null float64
71    2851 non-null float64
dtypes: float64(72)
memory usage: 1.6 MB

In [307]:
bigdata.dropna()

,0,1,2,3,4,5,6,7,8,9,...,62,63,64,65,66,67,68,69,70,71
0,1.0,82.0,81.0,91.0,65.0,130.0,88.0,61.0,113.0,72.0,...,0.258065,0.225806,0.387097,0.258065,0.258065,0.322581,0.193548,86.642857,0.154971,0.283410
1,1.0,100.0,72.0,79.0,53.0,110.0,119.0,88.0,58.0,64.0,...,0.290323,0.258065,0.322581,0.225806,0.258065,0.354839,0.322581,80.500000,0.188229,0.301843
2,1.0,133.0,118.0,145.0,118.0,88.0,102.0,89.0,105.0,103.0,...,0.290323,0.193548,0.419355,0.258065,0.258065,0.290323,0.451613,116.000000,0.323314,0.334101
3,1.0,136.0,104.0,147.0,92.0,79.0,129.0,88.0,69.0,120.0,...,0.322581,0.322581,0.419355,0.354839,0.225806,0.290323,0.516129,116.000000,0.354171,0.361751
4,1.0,150.0,139.0,135.0,106.0,79.0,100.0,97.0,95.0,97.0,...,0.322581,0.258065,0.419355,0.290323,0.258065,0.419355,0.612903,116.714286,0.319543,0.370968
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2901,56.0,79.0,73.0,89.0,72.0,52.0,78.0,67.0,77.0,71.0,...,0.129032,0.225806,0.193548,0.129032,0.129032,0.258065,0.225806,77.714286,0.092229,0.184332
2902,56.0,65.0,98.0,73.0,75.0,62.0,67.0,85.0,68.0,64.0,...,0.258065,0.225806,0.225806,0.161290,0.225806,0.161290,0.290323,75.142857,0.133714,0.235023
2903,56.0,88.0,85.0,71.0,63.0,104.0,81.0,85.0,80.0,82.0,...,0.225806,0.258065,0.290323,0.322581,0.322581,0.225806,0.258065,77.214286,0.153600,0.267281
2904,56.0,99.0,98.0,80.0,95.0,71.0,76.0,70.0,78.0,54.0,...,0.225806,0.225806,0.258065,0.225806,0.193548,0.225806,0.354839,74.714286,0.111429,0.258065
2905,56.0,80.0,73.0,97.0,94.0,61.0,65.0,96.0,70.0,54.0,...,0.225806,0.225806,0.290323,0.258065,0.193548,0.322581,0.322581,71.857143,0.114514,0.260369

In [323]:
dataframe3 = pd.read_csv('ex3.csv', nrows=3)

In [324]:
chunklist = []

In [322]:
# for chunk in dataframe3:
#     chunklist.append(chunk)

In [325]:
dataframe3

  key1 key2  value1  value2
0  one    a     1.0       2
1  one    b     NaN       4
2  one    c     5.0       6

In [329]:
chunks = pd.read_csv('ex3.csv', chunksize=3)

In [330]:
print(type(chunks), print(chunks))

<pandas.io.parsers.TextFileReader object at 0x00000256D3676688>
<class 'pandas.io.parsers.TextFileReader'> None

In [342]:
for chunk in chunks:
#     print(len(chunk))
    print(chunk.head())
    chunklist.append(chunk)